<?php

namespace App\Http\Controllers\Api;

use Illuminate\Http\Request;

use App\Http\Requests;
use App\Http\Controllers\Controller;

class CatagoryController extends Controller
{
    public function FirstCata(){
        $data = [
            [
                'ID' => 1,
                'classifyName' => '语文',
            ],
            [
                'ID' => 2,
                'classifyName' => '数学',
            ],
            [
                'ID' => 3,
                'classifyName' => '英语',
            ],
            [
                'ID' => 4,
                'classifyName' => '化学',
            ],
            [
                'ID' => 5,
                'classifyName' => '物理',
            ]
        ];
        return response()->json($data);
    }


    public function SecondCata(){
        $data = [
            '语文二级分类1',
            '语文二级分类2',
            '语文二级分类3',
            '语文二级分类4',
            '语文二级分类5',
        ];

        $parent = request('parent', '');

        if(!empty($parent)){
            switch($parent){
                case "1":
                    $data = [
                        '语文二级分类1',
                        '语文二级分类2',
                        '语文二级分类3',
                        '语文二级分类4',
                        '语文二级分类5',
                    ];
                    break;
                case "2":
                    $data = [
                        '数学二级分类1',
                        '数学二级分类2',
                        '数学二级分类3',
                        '数学二级分类4',
                        '数学二级分类5',
                    ];
                    break;
                case "3":
                    $data = [
                        '英语二级分类1',
                        '英语二级分类2',
                        '英语二级分类3',
                        '英语二级分类4',
                        '英语二级分类5',
                    ];
                    break;
                case "4":
                    $data = [
                        '化学二级分类1',
                        '化学二级分类2',
                        '化学二级分类3',
                        '化学二级分类4',
                        '化学二级分类5',
                    ];
                    break;
                case "5":
                    $data = [
                        '物理二级分类1',
                        '物理二级分类2',
                        '物理二级分类3',
                        '物理二级分类4',
                        '物理二级分类5',
                    ];
                    break;
            }
        }
        
        return response()->json($data);
    }

    public function projectList(){
        $data = [
            '语文二级分类1--产品1',
            '语文二级分类1--产品2',
            '语文二级分类1--产品3',
            '语文二级分类1--产品4',
            '语文二级分类1--产品5',
            '语文二级分类1--产品6',
            '语文二级分类1--产品7',
            '语文二级分类1--产品8',
            '语文二级分类1--产品9',
        ];

        $cata = request('cata', '');
        if(!empty($cata)){
            switch($cata){
                case "语文二级分类1":
                    $data = [
                        '语文二级分类1--产品1',
                        '语文二级分类1--产品2',
                        '语文二级分类1--产品3',
                        '语文二级分类1--产品4',
                        '语文二级分类1--产品5',
                        '语文二级分类1--产品6',
                        '语文二级分类1--产品7',
                        '语文二级分类1--产品8',
                        '语文二级分类1--产品9',
                    ];
                    break;
                case "语文二级分类2":
                    $data = [
                        '语文二级分类2--产品1',
                        '语文二级分类2--产品2',
                        '语文二级分类2--产品3',
                        '语文二级分类2--产品4',
                        '语文二级分类2--产品5',
                        '语文二级分类2--产品6',
                        '语文二级分类2--产品7',
                        '语文二级分类2--产品8',
                        '语文二级分类2--产品9',
                    ];
                    break;
                case "语文二级分类3":
                    $data = [
                        '语文二级分类3--产品1',
                        '语文二级分类3--产品2',
                        '语文二级分类3--产品3',
                        '语文二级分类3--产品4',
                        '语文二级分类3--产品5',
                        '语文二级分类3--产品6',
                        '语文二级分类3--产品7',
                        '语文二级分类3--产品8',
                        '语文二级分类3--产品9',
                    ];
                    break;
                case "语文二级分类4":
                    $data = [
                        '语文二级分类4--产品1',
                        '语文二级分类4--产品2',
                        '语文二级分类4--产品3',
                        '语文二级分类4--产品4',
                        '语文二级分类4--产品5',
                        '语文二级分类4--产品6',
                        '语文二级分类4--产品7',
                        '语文二级分类4--产品8',
                        '语文二级分类4--产品9',
                    ];
                    break;
                case "语文二级分类5":
                    $data = [
                        '语文二级分类5--产品1',
                        '语文二级分类5--产品2',
                        '语文二级分类5--产品3',
                        '语文二级分类5--产品4',
                        '语文二级分类5--产品5',
                        '语文二级分类5--产品6',
                        '语文二级分类5--产品7',
                        '语文二级分类5--产品8',
                        '语文二级分类5--产品9',
                    ];
                    break;
                case "数学二级分类1":
                    $data = [
                        '数学二级分类1--产品1',
                        '数学二级分类1--产品2',
                        '数学二级分类1--产品3',
                        '数学二级分类1--产品4',
                        '数学二级分类1--产品5',
                        '数学二级分类1--产品6',
                        '数学二级分类1--产品7',
                        '数学二级分类1--产品8',
                        '数学二级分类1--产品9',
                    ];
                    break;
                case "数学二级分类2":
                    $data = [
                        '数学二级分类2--产品1',
                        '数学二级分类2--产品2',
                        '数学二级分类2--产品3',
                        '数学二级分类2--产品4',
                        '数学二级分类2--产品5',
                        '数学二级分类2--产品6',
                        '数学二级分类2--产品7',
                        '数学二级分类2--产品8',
                        '数学二级分类2--产品9',
                    ];
                    break;
                case "数学二级分类3":
                    $data = [
                        '数学二级分类3--产品1',
                        '数学二级分类3--产品2',
                        '数学二级分类3--产品3',
                        '数学二级分类3--产品4',
                        '数学二级分类3--产品5',
                        '数学二级分类3--产品6',
                        '数学二级分类3--产品7',
                        '数学二级分类3--产品8',
                        '数学二级分类3--产品9',
                    ];
                    break;
                case "数学二级分类4":
                    $data = [
                        '数学二级分类4--产品1',
                        '数学二级分类4--产品2',
                        '数学二级分类4--产品3',
                        '数学二级分类4--产品4',
                        '数学二级分类4--产品5',
                        '数学二级分类4--产品6',
                        '数学二级分类4--产品7',
                        '数学二级分类4--产品8',
                        '数学二级分类4--产品9',
                    ];
                    break;
                case "数学二级分类5":
                    $data = [
                        '数学二级分类5--产品1',
                        '数学二级分类5--产品2',
                        '数学二级分类5--产品3',
                        '数学二级分类5--产品4',
                        '数学二级分类5--产品5',
                        '数学二级分类5--产品6',
                        '数学二级分类5--产品7',
                        '数学二级分类5--产品8',
                        '数学二级分类5--产品9',
                    ];
                    break;
                case "物理二级分类1":
                    $data = [
                        '物理二级分类1--产品1',
                        '物理二级分类1--产品2',
                        '物理二级分类1--产品3',
                        '物理二级分类1--产品4',
                        '物理二级分类1--产品5',
                        '物理二级分类1--产品6',
                        '物理二级分类1--产品7',
                        '物理二级分类1--产品8',
                        '物理二级分类1--产品9',
                    ];
                    break;
                case "物理二级分类2":
                    $data = [
                        '物理二级分类2--产品1',
                        '物理二级分类2--产品2',
                        '物理二级分类2--产品3',
                        '物理二级分类2--产品4',
                        '物理二级分类2--产品5',
                        '物理二级分类2--产品6',
                        '物理二级分类2--产品7',
                        '物理二级分类2--产品8',
                        '物理二级分类2--产品9',
                    ];
                    break;
                case "物理二级分类3":
                    $data = [
                        '物理二级分类3--产品1',
                        '物理二级分类3--产品2',
                        '物理二级分类3--产品3',
                        '物理二级分类3--产品4',
                        '物理二级分类3--产品5',
                        '物理二级分类3--产品6',
                        '物理二级分类3--产品7',
                        '物理二级分类3--产品8',
                        '物理二级分类3--产品9',
                    ];
                    break;
                case "物理二级分类4":
                    $data = [
                        '物理二级分类4--产品1',
                        '物理二级分类4--产品2',
                        '物理二级分类4--产品3',
                        '物理二级分类4--产品4',
                        '物理二级分类4--产品5',
                        '物理二级分类4--产品6',
                        '物理二级分类4--产品7',
                        '物理二级分类4--产品8',
                        '物理二级分类4--产品9',
                    ];
                    break;
                case "物理二级分类5":
                    $data = [
                        '物理二级分类5--产品1',
                        '物理二级分类5--产品2',
                        '物理二级分类5--产品3',
                        '物理二级分类5--产品4',
                        '物理二级分类5--产品5',
                        '物理二级分类5--产品6',
                        '物理二级分类5--产品7',
                        '物理二级分类5--产品8',
                        '物理二级分类5--产品9',
                    ];
                    break;
                case "化学二级分类1":
                    $data = [
                        '化学二级分类1--产品1',
                        '化学二级分类1--产品2',
                        '化学二级分类1--产品3',
                        '化学二级分类1--产品4',
                        '化学二级分类1--产品5',
                        '化学二级分类1--产品6',
                        '化学二级分类1--产品7',
                        '化学二级分类1--产品8',
                        '化学二级分类1--产品9',
                    ];
                    break;
                case "化学二级分类2":
                    $data = [
                        '化学二级分类2--产品1',
                        '化学二级分类2--产品2',
                        '化学二级分类2--产品3',
                        '化学二级分类2--产品4',
                        '化学二级分类2--产品5',
                        '化学二级分类2--产品6',
                        '化学二级分类2--产品7',
                        '化学二级分类2--产品8',
                        '化学二级分类2--产品9',
                    ];
                    break;
                case "化学二级分类3":
                    $data = [
                        '化学二级分类3--产品1',
                        '化学二级分类3--产品2',
                        '化学二级分类3--产品3',
                        '化学二级分类3--产品4',
                        '化学二级分类3--产品5',
                        '化学二级分类3--产品6',
                        '化学二级分类3--产品7',
                        '化学二级分类3--产品8',
                        '化学二级分类3--产品9',
                    ];
                    break;
                case "化学二级分类4":
                    $data = [
                        '化学二级分类4--产品1',
                        '化学二级分类4--产品2',
                        '化学二级分类4--产品3',
                        '化学二级分类4--产品4',
                        '化学二级分类4--产品5',
                        '化学二级分类4--产品6',
                        '化学二级分类4--产品7',
                        '化学二级分类4--产品8',
                        '化学二级分类4--产品9',
                    ];
                    break;
                case "化学二级分类5":
                    $data = [
                        '化学二级分类5--产品1',
                        '化学二级分类5--产品2',
                        '化学二级分类5--产品3',
                        '化学二级分类5--产品4',
                        '化学二级分类5--产品5',
                        '化学二级分类5--产品6',
                        '化学二级分类5--产品7',
                        '化学二级分类5--产品8',
                        '化学二级分类5--产品9',
                    ];
                    break;
                case "英语二级分类1":
                    $data = [
                        '英语二级分类1--产品1',
                        '英语二级分类1--产品2',
                        '英语二级分类1--产品3',
                        '英语二级分类1--产品4',
                        '英语二级分类1--产品5',
                        '英语二级分类1--产品6',
                        '英语二级分类1--产品7',
                        '英语二级分类1--产品8',
                        '英语二级分类1--产品9',
                    ];
                    break;
                case "英语二级分类2":
                    $data = [
                        '英语二级分类2--产品1',
                        '英语二级分类2--产品2',
                        '英语二级分类2--产品3',
                        '英语二级分类2--产品4',
                        '英语二级分类2--产品5',
                        '英语二级分类2--产品6',
                        '英语二级分类2--产品7',
                        '英语二级分类2--产品8',
                        '英语二级分类2--产品9',
                    ];
                    break;
                case "英语二级分类3":
                    $data = [
                        '英语二级分类3--产品1',
                        '英语二级分类3--产品2',
                        '英语二级分类3--产品3',
                        '英语二级分类3--产品4',
                        '英语二级分类3--产品5',
                        '英语二级分类3--产品6',
                        '英语二级分类3--产品7',
                        '英语二级分类3--产品8',
                        '英语二级分类3--产品9',
                    ];
                    break;
                case "英语二级分类4":
                    $data = [
                        '英语二级分类4--产品1',
                        '英语二级分类4--产品2',
                        '英语二级分类4--产品3',
                        '英语二级分类4--产品4',
                        '英语二级分类4--产品5',
                        '英语二级分类4--产品6',
                        '英语二级分类4--产品7',
                        '英语二级分类4--产品8',
                        '英语二级分类4--产品9',
                    ];
                    break;
                case "英语二级分类5":
                    $data = [
                        '英语二级分类5--产品1',
                        '英语二级分类5--产品2',
                        '英语二级分类5--产品3',
                        '英语二级分类5--产品4',
                        '英语二级分类5--产品5',
                        '英语二级分类5--产品6',
                        '英语二级分类5--产品7',
                        '英语二级分类5--产品8',
                        '英语二级分类5--产品9',
                    ];
                    break;
            }
        }

        return response()->json($data);
    }
}
